In [1]:
import pandas as pd

In [6]:
data1 = {
'A':[1, 2, None, 4, 5],
'B':[10, None, 30, 40, 50]
}

df = pd.DataFrame(data1)

In [7]:
df
#NaN - Not a Number

     A     B
0  1.0  10.0
1  2.0   NaN
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [9]:
df.fillna(df.mean(), inplace=True)
#preenche um Nan com a media

In [11]:
df

     A     B
0  1.0  10.0
1  2.0  32.5
2  3.0  30.0
3  4.0  40.0
4  5.0  50.0

In [12]:
data2 = {
'A':[1, 2, None, 4, 5],
'B':[10, None, 30, 40, 50]
}

df = pd.DataFrame(data2)

In [ ]:
#remover as linhas com ao menos 1 valor ausente

#inplace = True => modificar o dataframe diretamente
#se for inplace =False => nao fara isso

In [13]:
df.dropna(inplace=True)

In [14]:
df

     A     B
0  1.0  10.0
3  4.0  40.0
4  5.0  50.0

In [15]:
data3 = {
'A':[1, 2, None, 4, 5],
'B':[10, None, 30, 40, 50]
}

df = pd.DataFrame(data3)

In [ ]:
#preencher os valores ausentes com um valor especifico (por exemplo, -1)

In [16]:
df.fillna(-1, inplace=True)
df

     A     B
0  1.0  10.0
1  2.0  -1.0
2 -1.0  30.0
3  4.0  40.0
4  5.0  50.0

In [17]:
data4 = {
'A':[1, 2, None, 4, 5],
'B':[10, None, 30, 40, 50]
}

df = pd.DataFrame(data4)

In [21]:
# Total de Nan por coluna
nan_col = df.isna().sum()
nan_col

A    1
B    1
dtype: int64

In [22]:
# Total de Nan do df todo
totalNan = df.isna().sum().sum()
totalNan

2

In [23]:
data5 = {
'A':[1, 2, None, 4, 5],
'B':[10, None, 30, 40, 50]
}

df = pd.DataFrame(data5)

In [ ]:
# quer que o comando só aconteca em 1 coluna em especifico

In [24]:
df['B'].fillna(-1, inplace=True)

In [28]:
#depois testar
#df[{'B'},{'A'}].fillna(-1, inplace=True)

TypeError: Passing a set as an indexer is not supported. Use a list instead.

In [25]:
df

     A     B
0  1.0  10.0
1  2.0  -1.0
2  NaN  30.0
3  4.0  40.0
4  5.0  50.0

In [29]:
data6 = {
'A':[1, 2, None, 4, 5],
'B':[10, None, 30, 40, 50]
}

df = pd.DataFrame(data6)

In [34]:
df['A'].fillna(df['A'].median(), inplace=True)
df['B'].fillna(df['B'].ffill(), inplace=True) 
#preenchimento pra frente, do valor que eu tenho atras, se for valido, senao procura o outro valido (foward fill)

In [33]:
df

     A     B
0  1.0  10.0
1  2.0  10.0
2  3.0  30.0
3  4.0  40.0
4  5.0  50.0

In [36]:
data7 = {'A':[1, 2, 3, 4, 2, 6],
         'B':[10, 20, 30, 10, 50, 60]}

df = pd.DataFrame(data7)

In [38]:
#mostra apenas quais colunas estao com valores duplicados
duplicadas = df[df.duplicated()]
duplicadas

A
2    1
Name: count, dtype: int64

In [39]:
#qtdas estao duplicados?
valoresDuplicados = df['A'][df['A'].duplicated()].value_counts()
valoresDuplicados

A
2    1
Name: count, dtype: int64

In [40]:
valoresDuplicados1 = df['B'][df['B'].duplicated()].value_counts()
valoresDuplicados1

B
10    1
Name: count, dtype: int64

In [41]:
data8 = {'A':[1, 2, 3, 4, 2, 6, 8, 9, 2, 5, 2],
        'B':[10, 20, 30, 10, 50, 60, 70, 67, 34, 56, 89]}

df = pd.DataFrame(data8)

In [42]:
valoresDuplicados2 = df['A'][df['A'].duplicated()].value_counts()
valoresDuplicados2

A
2    3
Name: count, dtype: int64

In [43]:
data9 = {'A':[1, 2, 3, 4, 2, 6, 8, 9, 2, 5, 2],
        'B':[10, 20, 30, 10, 50, 60, 70, 67, 34, 56, 89]}

df = pd.DataFrame(data9)

In [44]:
#remove todas as linhas duplicadas em todas as informações precisam estar iguais 
removeDuplicadas = df.drop_duplicates()
removeDuplicadas

    A   B
0   1  10
1   2  20
2   3  30
3   4  10
4   2  50
5   6  60
6   8  70
7   9  67
8   2  34
9   5  56
10  2  89

In [45]:
#remover por coluna (cuidado que tira de todas as colunas)
removeDuplicadasA = df.drop_duplicates(subset =['A'])
removeDuplicadasA

   A   B
0  1  10
1  2  20
2  3  30
3  4  10
5  6  60
6  8  70
7  9  67
9  5  56